conf/src/Enums/СрочностьИсправленияОшибок/СрочностьИсправленияОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СрочностьИсправленияОшибок</name>
  <enumValues>
    <name>Немедленно</name>
  </enumValues>
  <enumValues>
    <name>ЖелательноБыстрее</name>
  </enumValues>
  <enumValues>
    <name>ВПлановомПорядке</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/ВерсииПроекта/ВерсииПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииПроекта</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ВерсияМеханизмаОбновленияИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ветка</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВключенияБиблиотек</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиКПредварительномуВстраиванию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВнешнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <comment>Начало разработки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРазработки</name>
    <comment>Окончание разработки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредстоящейСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияПоддержки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяХранилищаДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьКонфигурациюИзХранилищаПриЗагрузкеМетаданных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяХранилищаДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПубликуемыйНомерВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПатчи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВерсииВключаемыхПроектов</name>
    <attributes>
      <name>Версия</name>
      <type>
        <types>CatalogRef.ВерсииПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтличияВИменахМетаданных</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтличияВСоставеПодсистем</name>
    <attributes>
      <name>Подсистема</name>
      <type>
        <types>CatalogRef.Подсистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектНужноДобавитьВПодсистему</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Enums/СрочностьИсправленияОшибок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Владелец") Тогда
		Возврат;
	КонецЕсли;
	
	СборкаОбнаружения = Неопределено;
	ВеткаОбнаружения = Неопределено;
	
	ОтборПоСборке = Параметры.Свойство("СборкаОбнаружения", СборкаОбнаружения);
	ОтборПоВетке  = Параметры.Свойство("ВеткаОбнаружения",  ВеткаОбнаружения);
	
	Если НЕ ОтборПоСборке и НЕ ОтборПоВетке Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
		
	Если ЗначениеЗаполнено(СборкаОбнаружения) Тогда
		Версия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СборкаОбнаружения, "Владелец");
	ИначеЕсли ЗначениеЗаполнено(ВеткаОбнаружения) Тогда
		Версия = Справочники.Ошибки.ВерсияОбнаруженияДляВетки(ВеткаОбнаружения);
	Иначе
		Версия = Справочники.ВерсииПроекта.ПустаяСсылка();
	КонецЕсли;
		
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияИсправленияНемедленно КАК ВерсияИсправленияНемедленно,
	|	ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияИсправленияЖелательноБыстрее КАК ВерсияИсправленияЖелательноБыстрее,
	|	ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияИсправленияВПлановомПорядке КАК ВерсияИсправленияВПлановомПорядке
	|ИЗ
	|	Справочник.Проекты.ПорядокВоспроизведенияИИсправленияОшибок КАК ПроектыПорядокВоспроизведенияИИсправленияОшибок
	|ГДЕ
	|	ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияВоспроизведения = &ВерсияОбнаружения
	| И (Не &ОтбиратьПоСтрокеПоиска 
	|	ИЛИ ""Немедленно"" ПОДОБНО &СтрокаПоиска
	|	ИЛИ ""Желательно быстрее"" ПОДОБНО &СтрокаПоиска
	|	ИЛИ ""В плановом порядке"" ПОДОБНО &СтрокаПоиска)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияВоспроизведения"
	;
	
	ВерсияНемедленно = Неопределено;
	ВерсияЖелательноБыстрее = Неопределено;
	ВерсияВПлановомПорядке = Неопределено;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВерсияОбнаружения", Версия);
	
	СтрокаПоиска = Параметры.СтрокаПоиска;
	
	Если СтрокаПоиска <> Неопределено Тогда
		Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска + "%");
		Запрос.УстановитьПараметр("ОтбиратьПоСтрокеПоиска", Истина);
	Иначе
		Запрос.УстановитьПараметр("СтрокаПоиска", "");
		Запрос.УстановитьПараметр("ОтбиратьПоСтрокеПоиска", Ложь);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			Если ЗначениеЗаполнено(Выборка.ВерсияИсправленияНемедленно) Тогда
				ВерсияНемедленно = Выборка.ВерсияИсправленияНемедленно;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ВерсияИсправленияЖелательноБыстрее) Тогда
				ВерсияЖелательноБыстрее = Выборка.ВерсияИсправленияЖелательноБыстрее;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ВерсияИсправленияВПлановомПорядке) Тогда
				ВерсияВПлановомПорядке = Выборка.ВерсияИсправленияВПлановомПорядке;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Если ВерсияНемедленно = Неопределено
		И ВерсияЖелательноБыстрее = Неопределено
		И ВерсияВПлановомПорядке = Неопределено
		И СтрокаПоиска <> Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПредставлениеНемедленно = 
		ПредставлениеСрочности(Перечисления.СрочностьИсправленияОшибок.Немедленно, ВерсияНемедленно);
	
	ПредставлениеЖелательноБыстрее = 
		ПредставлениеСрочности(Перечисления.СрочностьИсправленияОшибок.ЖелательноБыстрее, ВерсияЖелательноБыстрее);
	
	ПредставлениеВПлановомПорядке = 
		ПредставлениеСрочности(Перечисления.СрочностьИсправленияОшибок.ВПлановомПорядке, ВерсияВПлановомПорядке);
	
	ДанныеВыбора.Добавить(Перечисления.СрочностьИсправленияОшибок.Немедленно, ПредставлениеНемедленно);
	ДанныеВыбора.Добавить(Перечисления.СрочностьИсправленияОшибок.ЖелательноБыстрее, ПредставлениеЖелательноБыстрее);
	ДанныеВыбора.Добавить(Перечисления.СрочностьИсправленияОшибок.ВПлановомПорядке, ПредставлениеВПлановомПорядке);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеСрочности(ЗначениеСрочности, Версия)

	Если ЗначениеЗаполнено(Версия) Тогда
		Представление = Строка(ЗначениеСрочности) + " (" + Версия +  ")";
	Иначе
		Представление = Строка(ЗначениеСрочности);
	КонецЕсли;
	
	Возврат Представление;
		
КонецФункции
	
#КонецОбласти

#КонецЕсли
